########################################
# 数组的遍历
########################################
arr = [1, 2, 3, 4]

# 索引方式遍历
for i in range(len(arr)):
    print(i, arr[i])

# 迭代器方式遍历
for i, val in enumerate(arr):
    print(i, val)

########################################
# 数组的增删改查和切片
########################################
arr = [1, 2, 3, 4]

# 在数组末尾添加元素
arr.append(5)  # [1, 2, 3, 4, 5]

# 在数组特定位置插入元素
arr.insert(1, 100)  # [1, 100, 2, 3, 4, 5]

# 按值删除元素, 若不存在这个元素则 ValueError: list.remove(x): x not in list
arr.remove(100)  # [1, 2, 3, 4, 5]

# 修改特定位置的元素
arr[-1] = 100  # [1, 2, 3, 4, 100]

# 数组切片, start:end:step  start是包括start所在的索引，end不包括end所在索引
print(arr[1:3])  # [2, 3]

# 通过切片实现反转
arr = arr[::-1]
print(arr)  # [100, 4, 3, 2, 1]
